## Example data Aptos

In [1]:

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

<img src='./imgs/exe11.png' style=''>

In [2]:

headers = ['ID', 'area', 'quartos', 'suites', 'vagas', 'preco']

data = pd.read_csv('./data/aptos.txt', sep=' ', names=headers)

In [3]:
data.head()

,ID,area,quartos,suites,vagas,preco
0,ID\tarea\tquartos\t\tsuites\tvagas\tpreco,NaN,NaN,NaN,NaN,NaN
1,NaN,353534.0,NaN,NaN,NaN,NaN
2,NaN,366113.0,NaN,NaN,NaN,NaN
3,NaN,186728.0,NaN,NaN,NaN,NaN
4,NaN,366115.0,NaN,NaN,NaN,NaN

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 221 entries, 0 to 220
Data columns (total 1 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ID	area	quartos		suites	vagas	preco  221 non-null    object
dtypes: object(1)
memory usage: 1.9+ KB

## Reference

[1]https://homepages.dcc.ufmg.br/%7Eassuncao/EstatCC/LivroDeExerciciosFECD.pdf
<br>
[2]https://homepages.dcc.ufmg.br/%7Eassuncao/EstatCC/FECD.pdf
<br>

<br>

<br>